Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.PaperSize Property
 The paper size name.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DotPrintPaperSize PaperSize { get; set; }
Public Property PaperSize As DotPrintPaperSize
	Get
	Set
Property Value
Type: DotPrintPaperSize
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace